Repository: HenriquesPontes/Near
Catalog: Near/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, pt, pt_br, ru, zh_hans

source: Copyright (c) 2026 Henriques Pontes. All rights reserved. IMPORTANT: PLEASE READ THIS SOFTWARE LICENSE AGREEMENT ("AGREEMENT") CAREFULLY BEFORE USING THE NEAR APP ("SOFTWARE"). BY USING THE SOFTWARE, YOU ARE AGREEING TO BE BOUND BY THE TERMS OF THIS LICENSE. 1. General The Software, documentation, and any fonts accompanying this License, whether on disk, in read only memory, on any other media or in any other form, are licensed, not sold, to you by Henriques Pontes ("Licensor") for use only under the terms of this License. Licensor retains ownership of the Software itself and reserves all rights not expressly granted to you. 2. Proprietary Nature The Software is closed-source, proprietary, and confidential. The source code, structure, organization, and algorithms of the Software are the valuable trade secrets and confidential information of the Licensor. 3. Permitted License Uses and Restrictions A. Subject to the terms and conditions of this License, you are granted a limited, non-exclusive, non-transferable license to install and use one copy of the Software on a single Apple-branded device that you own or control. B. You may not, and you agree not to or enable others to, copy, decompile, reverse engineer, disassemble, attempt to derive the source code of, decrypt, modify, or create derivative works of the Software or any services provided by the Software, or any part thereof. C. You may not rent, lease, lend, sell, redistribute, or sublicense the Software. D. Any attempt to do so is a violation of the rights of the Licensor. If you breach this restriction, you may be subject to prosecution and damages. 4. Consent to Use of Data You agree that Licensor may collect and use technical data and related information, including but not limited to technical information about your device, system and application software, and peripherals, that is gathered periodically to facilitate the provision of software updates, product support, and other services to you (if any) related to the Software. Licensor may use this information, as long as it is in a form that does not personally identify you, to improve its products or to provide services or technologies to you. 5. Termination This License is effective until terminated. Your rights under this License will terminate automatically without notice from the Licensor if you fail to comply with any term(s) of this License. Upon the termination of this License, you must cease all use of the Software and destroy all copies, full or partial, of the Software. 6. Disclaimer of Warranty YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT USE OF THE SOFTWARE IS AT YOUR SOLE RISK AND THAT THE ENTIRE RISK AS TO SATISFACTORY QUALITY, PERFORMANCE, ACCURACY, AND EFFORT IS WITH YOU. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SOFTWARE IS PROVIDED "AS IS" AND "AS AVAILABLE", WITH ALL FAULTS AND WITHOUT WARRANTY OF ANY KIND. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS WITH RESPECT TO THE SOFTWARE, EITHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES AND/OR CONDITIONS OF MERCHANTABILITY, OF SATISFACTORY QUALITY, OF FITNESS FOR A PARTICULAR PURPOSE, OF ACCURACY, OF QUIET ENJOYMENT, AND OF NON-INFRINGEMENT OF THIRD-PARTY RIGHTS. 7. Limitation of Liability TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT SHALL LICENSOR BE LIABLE FOR PERSONAL INJURY OR ANY INCIDENTAL, SPECIAL, INDIRECT, OR CONSEQUENTIAL DAMAGES WHATSOEVER, INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, LOSS OF DATA, BUSINESS INTERRUPTION, OR ANY OTHER COMMERCIAL DAMAGES OR LOSSES, ARISING OUT OF OR RELATED TO YOUR USE OR INABILITY TO USE THE SOFTWARE, HOWEVER CAUSED, REGARDLESS OF THE THEORY OF LIABILITY (CONTRACT, TORT, OR OTHERWISE) AND EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. 8. Governing Law This License will be governed by and construed in accordance with the laws of the jurisdiction in which the Licensor resides, excluding its conflict of law principles. Any dispute arising out of or in connection with this License shall be subject to the exclusive jurisdiction of the courts located in that jurisdiction.
ar: حقوق الطبع والنشر (ج) 2026 لهنريك بونتيس. جميع الحقوق محفوظة. هام: يرجى قراءة اتفاقية ترخيص البرنامج هذه ("الاتفاقية") بعناية قبل استخدام التطبيق NEAR ("البرنامج"). باستخدام البرنامج، فإنك توافق على الالتزام بشروط هذا الترخيص. 1. عام البرامج والوثائق وأي خطوط مصاحبة لهذا الترخيص، سواء كانت موجودة على القرص أو في ذاكرة القراءة فقط أو على أي وسائط أخرى أو بأي شكل آخر، مرخصة ولا يتم بيعها لك من قبل Henriques Pontes ("المرخص") للاستخدام فقط بموجب شروط هذا الترخيص. يحتفظ المرخص بملكية البرنامج نفسه ويحتفظ بجميع الحقوق غير الممنوحة لك صراحةً. 2. طبيعة الملكية البرنامج مغلق المصدر ومملوك وسري. تعد التعليمات البرمجية المصدرية للبرنامج وبنيته وتنظيمه وخوارزمياته بمثابة أسرار تجارية قيمة ومعلومات سرية للمرخص. 3. استخدامات الترخيص المسموح بها وقيودها ج. وفقًا لشروط وأحكام هذا الترخيص، يتم منحك ترخيصًا محدودًا وغير حصري وغير قابل للتحويل لتثبيت واستخدام نسخة واحدة من البرنامج على جهاز واحد يحمل علامة Apple التجارية تمتلكه أو تتحكم فيه. ب. لا يجوز لك، وتوافق على عدم القيام بذلك أو تمكين الآخرين، من القيام بنسخ أو إلغاء أو إجراء هندسة عكسية أو تفكيك أو محاولة استخلاص كود المصدر أو فك تشفير أو تعديل أو إنشاء أعمال مشتقة من البرنامج أو أي خدمات يقدمها البرنامج أو أي جزء منه. ج. لا يجوز لك استئجار البرنامج أو تأجيره أو إقراضه أو بيعه أو إعادة توزيعه أو ترخيصه من الباطن. د. تعتبر أي محاولة للقيام بذلك انتهاكًا لحقوق المرخص. إذا قمت بخرق هذا القيد، فقد تتعرض للملاحقة القضائية والتعويضات. 4. الموافقة على استخدام البيانات أنت توافق على أنه يجوز للمرخص جمع واستخدام البيانات الفنية والمعلومات ذات الصلة، بما في ذلك على سبيل المثال لا الحصر، المعلومات الفنية حول جهازك وبرامج النظام والتطبيقات والأجهزة الطرفية، والتي يتم جمعها بشكل دوري لتسهيل توفير تحديثات البرامج ودعم المنتج والخدمات الأخرى لك (إن وجدت) المتعلقة بالبرنامج. يجوز للمرخص استخدام هذه المعلومات، طالما أنها في شكل لا يحدد هويتك الشخصية، لتحسين منتجاته أو تقديم الخدمات أو التقنيات لك. 5. الإنهاء هذا الترخيص ساري المفعول حتى إنهائه. ستنتهي حقوقك بموجب هذا الترخيص تلقائيًا دون إشعار من المرخص إذا فشلت في الالتزام بأي شرط (شروط) من هذا الترخيص. عند إنهاء هذا الترخيص، يجب عليك التوقف عن استخدام البرنامج بالكامل وتدمير جميع نسخ البرنامج، الكاملة أو الجزئية. 6. إخلاء المسؤولية عن الضمان أنت تقر وتوافق صراحةً على أن استخدام البرنامج يقع على مسؤوليتك وحدك وأن المخاطر الكاملة المتعلقة بالجودة والأداء والدقة والجهد تقع على عاتقك أنت. إلى الحد الأقصى الذي يسمح به القانون المعمول به، يتم توفير البرنامج "كما هو" و"كما هو متاح"، مع جميع العيوب ودون أي ضمان من أي نوع. ينكر المرخص بموجب هذا جميع الضمانات والشروط المتعلقة بالبرنامج، سواء كانت صريحة أو ضمنية أو قانونية، بما في ذلك، على سبيل المثال لا الحصر، الضمانات الضمنية و/أو شروط القابلية للتسويق والجودة المُرضية والملاءمة لهدف معين. الغرض والدقة والاستمتاع الهادئ وعدم انتهاك حقوق الطرف الثالث. 7. حدود المسؤولية إلى الحد الذي لا يحظره القانون، لن يكون المرخص مسؤولاً بأي حال من الأحوال عن الإصابات الشخصية أو أي أضرار عرضية أو خاصة أو غير مباشرة أو تبعية على الإطلاق، بما في ذلك، على سبيل المثال لا الحصر، الأضرار الناجمة عن خسارة الأرباح أو فقدان البيانات أو الأعمال. الانقطاع، أو أي أضرار أو خسائر تجارية أخرى، تنشأ عن أو تتعلق باستخدامك أو عدم قدرتك على استخدام البرنامج، أيًا كان سببه، بغض النظر عن نظرية المسؤولية (العقد أو الضرر أو غير ذلك) وحتى لو تم إخطار المرخص إمكانية حدوث مثل هذه الأضرار. 8. القانون الحاكم سيخضع هذا الترخيص ويفسر وفقًا لقوانين الولاية القضائية التي يقيم فيها المرخص، باستثناء تعارضها مع مبادئ القانون. أي نزاع ينشأ عن هذا الترخيص أو فيما يتعلق به يجب أن يخضع للاختصاص القضائي الحصري للمحاكم الموجودة في تلك الولاية القضائية.
de: The full License Agreement text is provided in English only. Please refer to the English version.
es: Copyright (c) 2026 Henriques Pontes. Todos los derechos reservados. IMPORTANTE: LEA ESTE ACUERDO DE LICENÇA DE SOFTWARE ("ACUERDO") DETENIDAMENTE ANTES DE UTILIZAR LA APLICACIÓN NEAR ("SOFTWARE"). AL UTILIZAR EL SOFTWARE, USTED ACEPTA ESTAR SUJETO A LOS TÉRMINOS DE ESTA LICENCIA. 1. General El Software, la documentación y cualquier fuente que acompañe a esta Licencia, ya sea en disco, en memoria de solo lectura, en cualquier otro medio o en cualquier otra forma, se le otorgan en licencia, no se le venden, por Henriques Pontes ("Licenciante") para su uso exclusivo bajo los términos de esta Licencia. El Licenciante conserva la propiedad del Software y se reserva todos los derechos que no se le otorguen expresamente. 2. Naturaleza propietaria El Software es de código cerrado, propietario y confidencial. El código fuente, la estructura, la organización y los algoritmos del Software son valiosos secretos comerciales e información confidencial del Licenciante. 3. Usos permitidos y restricciones de la licencia A. Sujeto a los términos y condiciones de esta Licencia, se le otorga una licencia limitada, no exclusiva e intransferible para instalar y utilizar una copia del Software en un único dispositivo de la marca Apple que posea o controle. B. No puede, y acepta no hacerlo ni permitir que otros, copien, descompilen, realicen ingeniería inversa, desensamblen, intenten derivar el código fuente, descifren, modifiquen o creen trabajos derivados del Software o de los servicios proporcionados por el Software, o de cualquier parte del mismo. C. No puede alquilar, arrendar, prestar, vender, redistribuir o sublicenciar el Software. D. Cualquier intento de hacerlo es una violación de los derechos del Licenciante. Si incumple esta restricción, puede estar sujeto a procesamiento y daños. 4. Consentimiento para el uso de datos Usted acepta que el Licenciante pueda recopilar y utilizar datos técnicos e información relacionada, incluida, entre otras, información técnica sobre su dispositivo, sistema y software de aplicación, y periféricos, que se recopila periódicamente para facilitar la provisión de actualizaciones de software, soporte de productos y otros servicios (si corresponde) relacionados con el Software. El Licenciante puede utilizar esta información, siempre que esté en una forma que no lo identifique personalmente, para mejorar sus productos o proporcionarle servicios o tecnologías. 5. Terminación Esta Licencia es efectiva hasta que se rescinda. Sus derechos bajo esta Licencia terminarán automáticamente sin previo aviso por parte del Licenciante si no cumple con alguno de los términos de esta Licencia. Tras la terminación de esta Licencia, debe suspender todo uso del Software y destruir todas las copias, totales o parciales, del Software. 6. Descargo de responsabilidad de garantía USTED RECONOCE Y ACEPTA EXPRESAMENTE QUE EL USO DEL SOFTWARE ES BAJO SU PROPIO RIESGO Y QUE TODO EL RIESGO EN CUANTO A CALIDAD SATISFACTORIA, RENDIMIENTO, PRECISIÓN Y ESFUERZO RECAE SOBRE USTED. EN LA MEDIDA MÁXIMA PERMITIDA POR LA LEY APLICABLE, EL SOFTWARE SE PROPORCIONA "TAL CUAL" Y "SEGÚN DISPONIBILIDAD", CON TODAS SUS FALLAS Y SIN GARANTÍA DE NINGÚN TIPO. EL LICENCIANTE RENUNCIA A TODAS LAS GARANTÍAS Y CONDICIONES CON RESPECTO AL SOFTWARE, YA SEAN EXPRESAS, IMPLÍCITAS O ESTATUTARIAS, INCLUYENDO, ENTRE OTRAS, LAS GARANTÍAS IMPLÍCITAS Y/O CONDICIONES DE COMERCIABILIDAD, DE CALIDAD SATISFACTORIA, DE IDONEIDAD PARA UN PROPÓSITO PARTICULAR, DE PRECISIÓN, DE DISFRUTE TRANQUILO Y DE NO INFRACCIÓN DE DERECHOS DE TERCEROS. 7. Limitación de responsabilidad EN LA MEDIDA EN QUE LA LEY NO LO PROHÍBA, EN NINGÚN CASO EL LICENCIANTE SERÁ RESPONSABLE POR LESIONES PERSONALES O CUALQUIER DAÑO INCIDENTAL, ESPECIAL, INDIRECTO O CONSECUENTE, INCLUYENDO, ENTRE OTROS, DAÑOS POR PÉRDIDA DE BENEFICIOS, PÉRDIDA DE DATOS, INTERRUPCIÓN DEL NEGOCIO O CUALQUIER OTRO DAÑO O PÉRDIDA COMERCIAL, QUE SURJA O ESTÉ RELACIONADO CON SU USO O INCAPACIDAD PARA UTILIZAR EL SOFTWARE, CUALQUIERA QUE SEA SU CAUSA, INDEPENDIENTEMENTE DE LA TEORÍA DE RESPONSABILIDAD (CONTRATO, AGRAVIO O DE OTRO TIPO) E INCLUSO SI EL LICENCIANTE HA SIDO ADVERTIDO DE LA POSIBILIDAD DE TALES DAÑOS. 8. Ley aplicable Esta Licencia se regirá e interpretará de acuerdo con las leyes de la jurisdicción en la que reside el Licenciante, excluyendo sus principios de conflicto de leyes. Cualquier disputa que surja de o en conexión con esta Licencia estará sujeta a la jurisdicción exclusiva de los tribunales ubicados en esa jurisdicción.
fr: Le texte complet de l'accord de licence est fourni en anglais uniquement. Veuillez vous référer à la version anglaise.
hi: कॉपीराइट (सी) 2026 हेनरिक्स पोंटेस। सर्वाधिकार सुरक्षित। महत्वपूर्ण: कृपया नियर ऐप ("सॉफ़्टवेयर") का उपयोग करने से पहले इस सॉफ़्टवेयर लाइसेंस अनुबंध ("अनुबंध") को ध्यान से पढ़ें। सॉफ़्टवेयर का उपयोग करके, आप इस लाइसेंस की शर्तों से बंधे होने के लिए सहमत हो रहे हैं। 1. सामान्य सॉफ़्टवेयर, दस्तावेज़ीकरण, और इस लाइसेंस के साथ आने वाले किसी भी फ़ॉन्ट, चाहे डिस्क पर, केवल पढ़ने योग्य मेमोरी में, किसी अन्य मीडिया पर या किसी अन्य रूप में, केवल इस लाइसेंस की शर्तों के तहत उपयोग के लिए हेनरिक्स पोंटेस ("लाइसेंसर") द्वारा आपको लाइसेंस दिया जाता है, बेचा नहीं जाता है। लाइसेंसकर्ता सॉफ़्टवेयर का स्वामित्व अपने पास रखता है और आपको स्पष्ट रूप से नहीं दिए गए सभी अधिकार सुरक्षित रखता है। 2. मालिकाना स्वभाव सॉफ्टवेयर बंद-स्रोत, मालिकाना और गोपनीय है। सॉफ़्टवेयर का स्रोत कोड, संरचना, संगठन और एल्गोरिदम लाइसेंसकर्ता के मूल्यवान व्यापार रहस्य और गोपनीय जानकारी हैं। 3. अनुमत लाइसेंस उपयोग और प्रतिबंध उ. इस लाइसेंस के नियमों और शर्तों के अधीन, आपको एक ऐप्पल-ब्रांडेड डिवाइस पर सॉफ़्टवेयर की एक प्रति स्थापित करने और उपयोग करने के लिए एक सीमित, गैर-विशिष्ट, गैर-हस्तांतरणीय लाइसेंस प्रदान किया जाता है, जो आपके स्वामित्व या नियंत्रण में है। बी. आप सॉफ़्टवेयर या सॉफ़्टवेयर द्वारा प्रदान की गई किसी भी सेवा या उसके किसी भी हिस्से की प्रतिलिपि बनाने, डिकंपाइल करने, रिवर्स इंजीनियर करने, अलग करने, स्रोत कोड प्राप्त करने, डिक्रिप्ट करने, संशोधित करने या व्युत्पन्न कार्यों को बनाने का प्रयास नहीं कर सकते हैं या दूसरों को सक्षम नहीं करने के लिए सहमत हैं। सी. आप सॉफ़्टवेयर को किराए पर नहीं दे सकते, पट्टे पर नहीं दे सकते, उधार नहीं दे सकते, बेच नहीं सकते, पुनर्वितरित नहीं कर सकते, या उप-लाइसेंस नहीं दे सकते। डी. ऐसा करने का कोई भी प्रयास लाइसेंसकर्ता के अधिकारों का उल्लंघन है। यदि आप इस प्रतिबंध का उल्लंघन करते हैं, तो आप पर मुकदमा चलाया जा सकता है और नुकसान भी हो सकता है। 4. डेटा के उपयोग के लिए सहमति आप इस बात से सहमत हैं कि लाइसेंसकर्ता तकनीकी डेटा और संबंधित जानकारी एकत्र और उपयोग कर सकता है, जिसमें आपके डिवाइस, सिस्टम और एप्लिकेशन सॉफ़्टवेयर और बाह्य उपकरणों के बारे में तकनीकी जानकारी शामिल है, लेकिन यह इन्हीं तक सीमित नहीं है, जो सॉफ़्टवेयर से संबंधित सॉफ़्टवेयर अपडेट, उत्पाद समर्थन और अन्य सेवाओं (यदि कोई हो) के प्रावधान को सुविधाजनक बनाने के लिए समय-समय पर एकत्र की जाती है। लाइसेंसकर्ता इस जानकारी का उपयोग अपने उत्पादों को बेहतर बनाने या आपको सेवाएं या तकनीक प्रदान करने के लिए कर सकता है, जब तक कि यह ऐसे रूप में हो जो आपकी व्यक्तिगत पहचान नहीं करता हो। 5. समाप्ति यह लाइसेंस समाप्त होने तक प्रभावी है। यदि आप इस लाइसेंस की किसी भी शर्त का पालन करने में विफल रहते हैं तो इस लाइसेंस के तहत आपके अधिकार लाइसेंसकर्ता से नोटिस के बिना स्वचालित रूप से समाप्त हो जाएंगे। इस लाइसेंस की समाप्ति पर, आपको सॉफ़्टवेयर का सभी उपयोग बंद करना होगा और सॉफ़्टवेयर की सभी प्रतियों, पूर्ण या आंशिक, को नष्ट करना होगा। 6. वारंटी का अस्वीकरण आप स्पष्ट रूप से स्वीकार करते हैं और सहमत हैं कि सॉफ़्टवेयर का उपयोग केवल आपके जोखिम पर है और संतोषजनक गुणवत्ता, प्रदर्शन, सटीकता और प्रयास का पूरा जोखिम आपके ऊपर है। लागू कानून द्वारा अनुमत अधिकतम सीमा तक, सॉफ़्टवेयर "जैसा है" और "जैसा उपलब्ध है", सभी दोषों के साथ और किसी भी प्रकार की वारंटी के बिना प्रदान किया जाता है। इसके द्वारा लाइसेंसदाता सॉफ़्टवेयर के संबंध में सभी वारंटी और शर्तों को अस्वीकार करता है, चाहे व्यक्त हो, निहित हो, या वैधानिक हो, जिसमें निहित वारंटी और/या व्यापारिकता की शर्तें, संतोषजनक गुणवत्ता, किसी विशेष के लिए उपयुक्तता शामिल है, लेकिन इन्हीं तक सीमित नहीं है। उद्देश्य, सटीकता, शांत आनंद और तीसरे पक्ष के अधिकारों का उल्लंघन न होना। 7. दायित्व की सीमा कानून द्वारा निषिद्ध न की गई सीमा तक, किसी भी स्थिति में लाइसेंसधारक व्यक्तिगत चोट या किसी भी आकस्मिक, विशेष, अप्रत्यक्ष या परिणामी क्षति के लिए उत्तरदायी नहीं होगा, जिसमें बिना किसी सीमा के, लाभ की हानि, डेटा की हानि शामिल है। व्यवसाय में रुकावट, या कोई अन्य व्यावसायिक क्षति या हानि, जो आपके उपयोग से या सॉफ़्टवेयर का उपयोग करने में असमर्थता से उत्पन्न होती है, चाहे वह किसी भी कारण से हो, दायित्व के सिद्धांत (अनुबंध, टॉर्ट, या अन्यथा) की परवाह किए बिना और भले ही लाइसेंसदाता के पास हो ऐसी क्षति की संभावना के बारे में सलाह दी गई है। 8. शासी कानून यह लाइसेंस कानून सिद्धांतों के टकराव को छोड़कर, उस क्षेत्राधिकार के कानूनों के अनुसार शासित और समझा जाएगा जिसमें लाइसेंसकर्ता रहता है। इस लाइसेंस से उत्पन्न या इसके संबंध में कोई भी विवाद उस क्षेत्राधिकार में स्थित अदालतों के विशेष क्षेत्राधिकार के अधीन होगा।
it: Il testo completo del Contratto di Licenza è fornito solo in inglese. Si prega di fare riferimento alla versione inglese.
ja: 著作権 (c) 2026 エンリケス ポンテス。無断転載を禁じます。 重要: NEAR アプリ (「ソフトウェア」) を使用する前に、このソフトウェア使用許諾契約 (「契約」) をよくお読みください。ソフトウェアを使用すると、このライセンス条項に拘束されることに同意したことになります。 1. 一般 本ライセンスに付随するソフトウェア、ドキュメント、およびフォントは、ディスク上、読み取り専用メモリ、その他のメディア上またはその他の形式を問わず、本ライセンスの条項に基づいてのみ使用するために Henriques Pontes (「ライセンサー」) によってお客様にライセンス供与されるものであり、販売されるものではありません。ライセンサーはソフトウェア自体の所有権を保持し、お客様に明示的に付与されていないすべての権利を留保します。 2. 独自の性質 ソフトウェアはクローズドソースであり、専有的であり、機密です。ソフトウェアのソース コード、構造、構成、およびアルゴリズムは、ライセンサーの貴重な企業秘密および機密情報です。 3. 許可されるライセンスの使用と制限 A. 本ライセンスの条項に従い、お客様には、お客様が所有または管理する 1 台の Apple ブランドのデバイスに本ソフトウェアの 1 コピーをインストールして使用するための、限定的、非独占的、譲渡不可のライセンスが付与されます。 B. お客様は、本ソフトウェアまたは本ソフトウェアによって提供されるサービス、またはその一部のコピー、逆コンパイル、リバース エンジニアリング、逆アセンブル、ソース コードの導出の試み、復号化、変更、または派生作品の作成を行うことはできず、また他人にそれらを許可しないことに同意するものとします。 C. ソフトウェアをレンタル、リース、貸与、販売、再配布、またはサブライセンスすることはできません。 D. そうしようとする試みはライセンサーの権利の侵害となります。この制限に違反した場合、訴追および損害賠償の対象となる可能性があります。 4. データ使用への同意 お客様は、ライセンサーが、お客様のデバイス、システム、アプリケーション ソフトウェア、および周辺機器に関する技術情報を含むがこれらに限定されない技術データおよび関連情報を収集および使用する場合があることに同意します。これらの情報は、ソフトウェアのアップデート、製品サポート、および本ソフトウェアに関連するその他のサービス (該当する場合) をお客様に提供しやすくするために定期的に収集されます。ライセンサーは、お客様を個人的に特定しない形式である限り、その製品を改善したり、お客様にサービスやテクノロジーを提供したりするために、この情報を使用することがあります。 5. 終了 このライセンスは終了するまで有効です。このライセンスに基づくお客様の権利は、お客様が本ライセンスの条項に従わなかった場合、ライセンサーからの通知なしに自動的に終了します。このライセンスが終了した場合、お客様はソフトウェアのすべての使用を中止し、ソフトウェアの全部または一部のすべてのコピーを破棄しなければなりません。 6. 保証の否認 お客様は、ソフトウェアの使用はお客様自身の責任で行われ、満足のいく品質、パフォーマンス、精度、および努力に関する全リスクはお客様にあることを明示的に認め、これに同意するものとします。適用される法律で許可される最大限の範囲で、ソフトウェアは「現状のまま」および「提供可能な状態」で、すべての欠陥があり、いかなる種類の保証もなく提供されます。ライセンサーは、明示的、黙示的、または法的を問わず、商品性、満足のいく品質、適合性の暗黙の保証および/または条件を含むがこれらに限定されない、本ソフトウェアに関するすべての保証および条件を否認します。正確さ、静かな楽しみ、および第三者の権利の非侵害という特定の目的のため。 7. 責任の制限 法律で禁止されていない限り、ライセンサーは、いかなる場合においても、人身傷害、または利益の損失、データの損失、ビジネスの損失による損害を含むがこれらに限定されない、あらゆる偶発的、特別、間接的、結果的損害に対して責任を負わないものとします。責任理論 (契約、不法行為、その他) にかかわらず、またライセンサーがソフトウェアの使用または使用不能に起因または関連する中断、またはその他の商業的損害または損失。かかる損害の可能性。 8. 準拠法 このライセンスは、抵触法の原則を除き、ライセンサーが居住する管轄区の法律に準拠し、それに従って解釈されます。本ライセンスに起因または関連して生じるあらゆる紛争は、その管轄区域にある裁判所の専属管轄権に従うものとします。
ko: 저작권 (c) 2026 Henriques Pontes. 모든 권리 보유. 중요: Near 앱("소프트웨어")을 사용하기 전에 이 소프트웨어 라이센스 계약("계약")을 주의 깊게 읽으십시오. 소프트웨어를 사용함으로써 귀하는 본 라이센스 조건을 준수할 것에 동의하게 됩니다. 1. 일반사항 본 라이센스와 함께 제공되는 소프트웨어, 문서 및 글꼴은 디스크, 읽기 전용 메모리, 기타 미디어 또는 기타 형식에 관계없이 Henriques Pontes("라이센스 제공자")가 본 라이센스 조건에 따라서만 사용할 수 있도록 라이센스를 부여한 것이지 판매한 것이 아닙니다. 라이센스 제공자는 소프트웨어 자체의 소유권을 보유하며 귀하에게 명시적으로 부여되지 않은 모든 권리를 보유합니다. 2. 소유권 성격 소프트웨어는 비공개 소스이고 독점적이며 기밀입니다. 소프트웨어의 소스 코드, 구조, 구성 및 알고리즘은 라이센스 제공자의 귀중한 영업 비밀이자 기밀 정보입니다. 3. 허용된 라이센스 사용 및 제한 A. 본 라이센스 약관에 따라 귀하는 귀하가 소유하거나 관리하는 단일 Apple 브랜드 장치에 소프트웨어 사본 하나를 설치하고 사용할 수 있는 제한적이고 비독점적이며 양도 불가능한 라이센스를 부여받습니다. B. 귀하는 소프트웨어나 소프트웨어가 제공하는 서비스 또는 그 일부를 복사, 디컴파일, 리버스 엔지니어링, 디스어셈블하고, 소스 코드 파생을 시도하거나, 암호 해독, 수정하거나, 파생 제품을 생성할 수 없으며, 다른 사람이 그렇게 하도록 동의하거나 허용하지 않습니다. C. 귀하는 소프트웨어를 임대, 대여, 판매, 재배포 또는 재라이센스를 부여할 수 없습니다. D. 그렇게 하려는 모든 시도는 라이센스 제공자의 권리를 침해하는 것입니다. 이 제한 사항을 위반할 경우 기소 및 손해 배상을 받을 수 있습니다. 4. 데이터 사용에 대한 동의 귀하는 소프트웨어 업데이트, 제품 지원 및 소프트웨어와 관련된 기타 서비스(있는 경우)를 귀하에게 제공하기 위해 정기적으로 수집되는 귀하의 장치, 시스템 및 응용 프로그램 소프트웨어, 주변 장치에 대한 기술 정보를 포함하되 이에 국한되지 않는 기술 데이터 및 관련 정보를 라이센스 허가자가 수집하고 사용할 수 있다는 데 동의합니다. 라이센스 허가자는 제품을 개선하거나 귀하에게 서비스나 기술을 제공하기 위해 귀하를 개인적으로 식별하지 않는 형태로 이 정보를 사용할 수 있습니다. 5. 해지 본 라이센스는 종료될 때까지 유효합니다. 귀하가 본 라이센스의 조건을 준수하지 않는 경우 본 라이센스에 따른 귀하의 권리는 라이센스 제공자의 통지 없이 자동으로 종료됩니다. 본 라이센스가 종료되면 귀하는 소프트웨어의 모든 사용을 중단하고 소프트웨어의 전체 또는 일부 사본을 모두 파기해야 합니다. 6. 보증의 부인 귀하는 소프트웨어 사용에 따른 위험은 전적으로 귀하의 책임이며 만족스러운 품질, 성능, 정확성 및 노력에 대한 모든 위험은 귀하에게 있음을 명시적으로 인정하고 이에 동의합니다. 해당 법률이 허용하는 최대 한도 내에서 소프트웨어는 모든 결함이 있고 어떠한 종류의 보증도 없이 "있는 그대로", "사용 가능한 대로" 제공됩니다. 이로써 라이센스 제공자는 상품성, 만족스러운 품질, 특정 적합성에 대한 묵시적인 보증 및/또는 조건을 포함하되 이에 국한되지 않고 명시적, 묵시적 또는 법적으로 소프트웨어와 관련된 모든 보증 및 조건을 부인합니다. 목적, 정확성, 조용한 즐거움, 제3자 권리 비침해. 7. 책임의 제한 법으로 금지되지 않는 범위 내에서 라이센스 제공자는 어떠한 경우에도 개인적인 상해나 부수적, 특수적, 간접적 또는 결과적 손해(이익 손실, 데이터 손실, 사업 중단 또는 기타 모든 손해를 포함하되 이에 국한되지 않음)에 대해 책임을 지지 않습니다. 책임 이론(계약, 불법 행위 또는 기타)에 관계없이, 그리고 라이센스 제공자가 그러한 손해의 가능성을 통보받은 경우에도 소프트웨어 사용 또는 사용 불가능으로 인해 발생하거나 이와 관련하여 발생하는 기타 상업적 손해 또는 손실. 8. 준거법 본 라이센스는 국제사법 원칙을 제외하고 라이센스 제공자가 거주하는 관할권의 법률에 따라 규율되고 해석됩니다. 본 라이센스로 인해 또는 이와 관련하여 발생하는 모든 분쟁은 해당 관할권에 위치한 법원의 전속적 관할권의 적용을 받습니다.
pt: Copyright (c) 2026 Henriques Pontes. Todos os direitos reservados. IMPORTANTE: LEIA ESTE CONTRATO DE LICENÇA DE SOFTWARE ("CONTRATO") COM ATENÇÃO ANTES DE USAR O APLICATIVO NEAR ("SOFTWARE"). AO USAR O SOFTWARE, VOCÊ CONCORDA EM FICAR VINCULADO AOS TERMOS DESTA LICENÇA. 1. Geral O Software, a documentação e quaisquer fontes que acompanhem esta Licença, seja em disco, em memória somente leitura, em qualquer outra mídia ou de qualquer outra forma, são licenciados, e não vendidos, a você por Henriques Pontes ("Licenciador") para uso apenas sob os termos desta Licença. O Licenciador retém a propriedade do próprio Software e reserva-se todos os direitos não expressamente concedidos a você. 2. Natureza Proprietária O Software é de código fechado, proprietário e confidencial. O código-fonte, a estrutura, a organização e os algoritmos do Software são valiosos segredos comerciais e informações confidenciais do Licenciador. 3. Usos Permitidos e Restrições da Licença A. Sujeito aos termos e condições desta Licença, é concedida a você uma licença limitada, não exclusiva e intransferível para instalar e usar uma cópia do Software em um único dispositivo da marca Apple que você possua ou controle. B. Você não pode, e concorda em não, nem permitir que outros, copiem, descompilem, façam engenharia reversa, desmontem, tentem derivar o código-fonte de, descriptografem, modifiquem ou criem trabalhos derivados do Software ou de quaisquer serviços fornecidos pelo Software, ou qualquer parte dele. C. Você não pode alugar, arrendar, emprestar, vender, redistribuir ou sublicenciar o Software. D. Qualquer tentativa de fazer isso é uma violação dos direitos do Licenciador. Se você violar essa restrição, poderá estar sujeito a processo e danos. 4. Consentimento para o Uso de Dados Você concorda que o Licenciador pode coletar e usar dados técnicos e informações relacionadas, incluindo, mas não se limitando a, informações técnicas sobre seu dispositivo, sistema e software aplicativo, e periféricos, que são reunidos periodicamente para facilitar o fornecimento de atualizações de software, suporte ao produto e outros serviços a você (se houver) relacionados ao Software. O Licenciador pode usar essas informações, desde que seja em uma forma que não o identifique pessoalmente, para melhorar seus produtos ou fornecer serviços ou tecnologias a você. 5. Rescisão Esta Licença é efetiva até ser rescindida. Seus direitos sob esta Licença terminarão automaticamente sem aviso prévio do Licenciador se você não cumprir qualquer termo(s) desta Licença. Após a rescisão desta Licença, você deve cessar todo o uso do Software e destruir todas as cópias, totais ou parciais, do Software. 6. Isenção de Garantia VOCÊ RECONHECE E CONCORDA EXPRESSAMENTE QUE O USO DO SOFTWARE É POR SUA CONTA E RISCO E QUE TODO O RISCO QUANTO À QUALIDADE SATISFATÓRIA, DESEMPENHO, PRECISÃO E ESFORÇO É SEU. NA MÁXIMA EXTENSÃO PERMITIDA PELA LEI APLICÁVEL, O SOFTWARE É FORNECIDO "COMO ESTÁ" E "CONFORME DISPONÍVEL", COM TODAS AS FALHAS E SEM GARANTIA DE QUALQUER TIPO. O LICENCIADOR SE ISENTA DE TODAS AS GARANTIAS E CONDIÇÕES COM RELAÇÃO AO SOFTWARE, SEJAM EXPRESSAS, IMPLÍCITAS OU ESTATUTÁRIAS, INCLUINDO, MAS NÃO SE LIMITANDO A, GARANTIAS IMPLÍCITAS E/OU CONDIÇÕES DE COMERCIALIZAÇÃO, DE QUALIDADE SATISFATÓRIA, DE ADEQUAÇÃO A UMA FINALIDADE ESPECÍFICA, DE PRECISÃO, DE DIVERTIMENTO TRANQUILO E DE NÃO VIOLAÇÃO DE DIREITOS DE TERCEIROS. 7. Limitação de Responsabilidade ATÉ A EXTENSÃO NÃO PROIBIDA POR LEI, EM NENHUM CASO O LICENCIADOR SERÁ RESPONSÁVEL POR FERIMENTOS PESSOAIS OU QUAISQUER DANOS INCIDENTAIS, ESPECIAIS, INDIRETOS OU CONSEQUENTES, INCLUINDO, SEM LIMITAÇÃO, DANOS POR PERDA DE LUCROS, PERDA DE DADOS, INTERRUPÇÃO DOS NEGÓCIOS OU QUAISQUER OUTROS DANOS OU PERDAS COMERCIAIS, DECORRENTES DE OU RELACIONADOS AO SEU USO OU INCAPACIDADE DE USAR O SOFTWARE, COMO QUER QUE SEJAM CAUSADOS, INDEPENDENTEMENTE DA TEORIA DE RESPONSABILIDADE (CONTRATO, DELITO OU OUTRO) E MESMO SE O LICENCIADOR TIVER SIDO AVISADO DA POSSIBILIDADE DE TAIS DANOS. 8. Lei Aplicável Esta Licença será regida e interpretada de acordo com as leis da jurisdição em que o Licenciador reside, excluindo seus princípios de conflito de leis. Qualquer disputa decorrente de ou em conexão com esta Licença estará sujeita à jurisdição exclusiva dos tribunais localizados nessa jurisdição.
pt_br: Copyright (c) 2026 Henriques Pontes. Todos os direitos reservados. IMPORTANTE: LEIA ESTE CONTRATO DE LICENÇA DE SOFTWARE ("CONTRATO") ATENTAMENTE ANTES DE USAR O APLICATIVO NEAR ("SOFTWARE"). AO USAR O SOFTWARE, VOCÊ CONCORDA EM CUMPRIR OS TERMOS DESTA LICENÇA. 1. Geral O Software, a documentação e quaisquer fontes que acompanham esta Licença, seja em disco, em memória somente leitura, em qualquer outra mídia ou em qualquer outra forma, são licenciados, e não vendidos, a você por Henriques Pontes ("Licenciante") para uso somente sob os termos desta Licença. O Licenciador retém a propriedade do Software e reserva todos os direitos não concedidos expressamente a você. 2. Natureza Proprietária O Software é de código fechado, proprietário e confidencial. O código-fonte, a estrutura, a organização e os algoritmos do Software são segredos comerciais valiosos e informações confidenciais do Licenciante. 3. Usos e restrições de licença permitidos A. Sujeito aos termos e condições desta Licença, é concedida a você uma licença limitada, não exclusiva e intransferível para instalar e usar uma cópia do Software em um único dispositivo da marca Apple que você possui ou controla. B. Você não pode, e concorda em não fazê-lo ou permitir que outros o façam, copiar, descompilar, fazer engenharia reversa, desmontar, tentar derivar o código-fonte, descriptografar, modificar ou criar trabalhos derivados do Software ou de quaisquer serviços fornecidos pelo Software, ou qualquer parte dele. C. Você não pode alugar, arrendar, emprestar, vender, redistribuir ou sublicenciar o Software. D. Qualquer tentativa de fazê-lo constitui uma violação dos direitos do Licenciante. Se você violar esta restrição, poderá estar sujeito a processos e danos. 4. Consentimento para uso de dados Você concorda que o Licenciador pode coletar e usar dados técnicos e informações relacionadas, incluindo, entre outros, informações técnicas sobre seu dispositivo, sistema e software de aplicativo e periféricos, que são coletados periodicamente para facilitar o fornecimento de atualizações de software, suporte ao produto e outros serviços para você (se houver) relacionados ao Software. O Licenciador poderá usar essas informações, desde que sejam de uma forma que não o identifique pessoalmente, para melhorar seus produtos ou para fornecer serviços ou tecnologias a você. 5. Rescisão Esta Licença é válida até ser rescindida. Seus direitos sob esta Licença terminarão automaticamente sem aviso prévio do Licenciador se você não cumprir qualquer termo desta Licença. Após a rescisão desta Licença, você deverá cessar todo uso do Software e destruir todas as cópias, totais ou parciais, do Software. 6. Isenção de Garantia VOCÊ RECONHECE E CONCORDA EXPRESSAMENTE QUE O USO DO SOFTWARE É POR SUA CONTA E RISCO E QUE TODO O RISCO QUANTO À QUALIDADE SATISFATÓRIA, DESEMPENHO, PRECISÃO E ESFORÇO É DE SUA responsabilidade. NA MEDIDA MÁXIMA PERMITIDA PELA LEI APLICÁVEL, O SOFTWARE É FORNECIDO "COMO ESTÁ" E "CONFORME DISPONÍVEL", COM TODAS AS FALHAS E SEM GARANTIA DE QUALQUER TIPO. O LICENCIADOR SE ISENTA DE TODAS AS GARANTIAS E CONDIÇÕES COM RELAÇÃO AO SOFTWARE, SEJAM EXPRESSAS, IMPLÍCITAS OU ESTATUTÁRIAS, INCLUINDO, MAS NÃO SE LIMITANDO A, GARANTIAS E/OU CONDIÇÕES IMPLÍCITAS DE COMERCIALIZAÇÃO, DE QUALIDADE SATISFATÓRIA, DE ADEQUAÇÃO A UM DETERMINADO FIM, DE PRECISÃO, DE PRAZER TRANQUILO E DE NÃO VIOLAÇÃO DE DIREITOS DE TERCEIROS. 7. Limitação de Responsabilidade NA MEDIDA NÃO PROIBIDA POR LEI, EM NENHUM CASO O LICENCIADOR SERÁ RESPONSÁVEL POR DANOS PESSOAIS OU QUAISQUER DANOS INCIDENTAIS, ESPECIAIS, INDIRETOS OU CONSEQUENTES DE QUALQUER TIPO, INCLUINDO, SEM LIMITAÇÃO, DANOS POR PERDA DE LUCROS, PERDA DE DADOS, INTERRUPÇÃO DE NEGÓCIOS OU QUAISQUER OUTROS DANOS COMERCIAIS OU PERDAS, DECORRENTES DE OU RELACIONADAS AO SEU USO OU INCAPACIDADE DE USAR O SOFTWARE, QUALQUER CAUSA, INDEPENDENTEMENTE DA TEORIA DE RESPONSABILIDADE (CONTRATO, ATO ILÍCITO OU OUTRA) E MESMO QUE O LICENCIADOR TENHA SIDO AVISADO DA POSSIBILIDADE DE TAIS DANOS. 8. Lei Aplicável Esta Licença será regida e interpretada de acordo com as leis da jurisdição em que o Licenciante reside, excluindo seus conflitos de princípios legais. Qualquer disputa decorrente ou relacionada a esta Licença estará sujeita à jurisdição exclusiva dos tribunais localizados nessa jurisdição.
ru: Авторские права (c) 2026 г. Энрикес Понтес. Все права защищены. ВАЖНО: ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧИТАЙТЕ ЭТО ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ НА ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ («СОГЛАШЕНИЕ») ПЕРЕД ИСПОЛЬЗОВАНИЕМ ПРИЛОЖЕНИЯ NEAR («ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ»). ИСПОЛЬЗУЯ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ, ВЫ СОГЛАШАЕТЕСЬ С УСЛОВИЯМИ НАСТОЯЩЕЙ ЛИЦЕНЗИИ. 1. Общие сведения Программное обеспечение, документация и любые шрифты, сопровождающие настоящую Лицензию, будь то на диске, в постоянной памяти, на любом другом носителе или в любой другой форме, лицензируются, а не продаются вам компанией Henriques Pontes («Лицензиар») для использования только в соответствии с условиями настоящей Лицензии. Лицензиар сохраняет за собой право собственности на Программное обеспечение и оставляет за собой все права, не предоставленные вам явно. 2. Собственный характер Программное обеспечение является закрытым, проприетарным и конфиденциальным. Исходный код, структура, организация и алгоритмы Программного обеспечения являются ценной коммерческой тайной и конфиденциальной информацией Лицензиара. 3. Разрешенное использование лицензии и ограничения О. В соответствии с условиями настоящей Лицензии вам предоставляется ограниченная, неисключительная, не подлежащая передаче лицензия на установку и использование одной копии Программного обеспечения на одном устройстве марки Apple, которым вы владеете или управляете. B. Вы не имеете права и соглашаетесь не разрешать другим лицам копировать, декомпилировать, перепроектировать, дизассемблировать, пытаться получить исходный код, расшифровывать, изменять или создавать производные продукты Программного обеспечения или любых услуг, предоставляемых Программным обеспечением, или любой его части. C. Вы не имеете права сдавать в аренду, одалживать, продавать, перераспределять или сублицензировать Программное обеспечение. D. Любая попытка сделать это является нарушением прав Лицензиара. Если вы нарушите это ограничение, вы можете подвергнуться судебному преследованию и возмещению ущерба. 4. Согласие на использование данных Вы соглашаетесь с тем, что Лицензиар может собирать и использовать технические данные и соответствующую информацию, включая, помимо прочего, техническую информацию о вашем устройстве, системном и прикладном программном обеспечении и периферийных устройствах, которая периодически собирается для облегчения предоставления вам обновлений программного обеспечения, поддержки продукта и других услуг (если таковые имеются), связанных с Программным обеспечением. Лицензиар может использовать эту информацию, если она представлена ​​в форме, не идентифицирующей вас лично, для улучшения своих продуктов или предоставления вам услуг или технологий. 5. Прекращение действия Данная Лицензия действительна до прекращения ее действия. Ваши права по настоящей Лицензии будут автоматически прекращены без уведомления Лицензиара, если вы не соблюдаете какое-либо условие(я) настоящей Лицензии. После прекращения действия настоящей Лицензии вы обязаны прекратить любое использование Программного обеспечения и уничтожить все копии Программного обеспечения, полные или частичные. 6. Отказ от гарантии ВЫ ЯВНО ПРИЗНАЕТЕ И СОГЛАШАЕТЕСЬ, ЧТО ИСПОЛЬЗУЕТЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ НА СВОЙ РИСК И ЧТО ВЕСЬ РИСК, КАСАЮЩИЙСЯ УДОВЛЕТВОРИТЕЛЬНОГО КАЧЕСТВА, ПРОИЗВОДИТЕЛЬНОСТИ, ТОЧНОСТИ И УСИЛИЙ, НЕСЕТЕ НА ВАС. В МАКСИМАЛЬНОЙ СТЕПЕНИ, РАЗРЕШЕННОЙ ДЕЙСТВУЮЩИМ ЗАКОНОДАТЕЛЬСТВОМ, ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ» И «КАК ДОСТУПНО», СО ВСЕМИ НЕИСПРАВНОСТЯМИ И БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ. ЛИЦЕНЗИАР НАСТОЯЩИМ ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ И УСЛОВИЙ В ОТНОШЕНИИ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ЯВНЫХ, ПОДРАЗУМЕВАЕМЫХ ИЛИ ЗАКОНОДАТЕЛЬНЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ И/ИЛИ УСЛОВИЯМИ ТОВАРНОЙ ЦЕННОСТИ, УДОВЛЕТВОРИТЕЛЬНОГО КАЧЕСТВА, ПРИГОДНОСТИ ДЛЯ КОНКРЕТНАЯ ЦЕЛЬ, ТОЧНОСТЬ, ТИХОЕ НАСЛАЖДЕНИЕ И НЕНАРУШЕНИЕ ПРАВ ТРЕТЬИХ ЛИЦ. 7. Ограничение ответственности В СТЕПЕНИ, НЕ ЗАПРЕЩЕННОЙ ЗАКОНОМ, ЛИЦЕНЗИАР НИ ПРИ КАКИХ СЛУЧАЯХ НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ТРАВМЫ ИЛИ ЛЮБЫЕ СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, КОСВЕННЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, УБЫТКИ ЗА ПОТЕРЮ ПРИБЫЛИ, ПОТЕРЮ ДАННЫХ, БИЗНЕСА ПЕРЕРЫВ ИЛИ ЛЮБЫЕ ДРУГИЕ КОММЕРЧЕСКИЕ УБЫТКИ ИЛИ ПОТЕРИ, ВОЗНИКАЮЩИЕ В РЕЗУЛЬТАТЕ ИЛИ СВЯЗАННЫЕ С ВАШИМ ИСПОЛЬЗОВАНИЕМ ИЛИ НЕВОЗМОЖНОСТЬЮ ИСПОЛЬЗОВАТЬ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ, НЕЗАВИСИМО ОТ ТЕОРИИ ОТВЕТСТВЕННОСТИ (ДОГОВОР, ПРАВИЛЬНОЕ ПРАВИЛО ИЛИ ДРУГОЕ) И ДАЖЕ ЕСЛИ ЛИЦЕНЗИАР БЫЛ УВЕДОМЛЕН О ВОЗМОЖНОСТЬ ТАКОГО ПОВРЕЖДЕНИЯ. 8. Применимое право Настоящая Лицензия будет регулироваться и толковаться в соответствии с законодательством юрисдикции, в которой проживает Лицензиар, за исключением принципов коллизионного права. Любой спор, возникающий из настоящей Лицензии или в связи с ней, подлежит исключительной юрисдикции судов, расположенных в этой юрисдикции.
zh_hans: 完整的许可协议文本仅提供英文版。请参阅英文版。
